pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_data.c
// 4200C6AA: void PDS_RAM_Config()
void PDS_RAM_Config()
{
	(*(<anonymous> **) 0x2101094C)();
}

// 4200C6B4: void PDS_Default_Level_Config()
void PDS_Default_Level_Config()
{
	(*(<anonymous> **) 0x21010950)();
}

// 4200C6BE: void SEC_Eng_Turn_On_Sec_Ring()
void SEC_Eng_Turn_On_Sec_Ring()
{
	(*(<anonymous> **) 0x21010978)();
}

// 4200C6C8: void SEC_Eng_Turn_Off_Sec_Ring()
void SEC_Eng_Turn_Off_Sec_Ring()
{
	(*(<anonymous> **) 0x2101097C)();
}

// 4200C6D2: void SFlash_Init()
void SFlash_Init()
{
	(*(<anonymous> **) 0x21010980)();
}

// 4200C6DC: void SFlash_SetSPIMode()
void SFlash_SetSPIMode()
{
	(*(<anonymous> **) 0x21010984)();
}

// 4200C6E6: void SFlash_Read_Reg()
void SFlash_Read_Reg()
{
	(*(<anonymous> **) 0x21010988)();
}

// 4200C6F0: void SFlash_Write_Reg()
void SFlash_Write_Reg()
{
	(*(<anonymous> **) 0x2101098C)();
}

// 4200C6FA: void SFlash_Busy()
void SFlash_Busy()
{
	(*(<anonymous> **) 0x21010990)();
}

// 4200C704: void SFlash_Write_Enable()
void SFlash_Write_Enable()
{
	(*(<anonymous> **) 553716116)();
}

// 4200C70E: void SFlash_Qspi_Enable()
void SFlash_Qspi_Enable()
{
	(*(<anonymous> **) 0x21010998)();
}

// 4200C718: void SFlash_Volatile_Reg_Write_Enable()
void SFlash_Volatile_Reg_Write_Enable()
{
	(*(<anonymous> **) 0x2101099C)();
}

// 4200C722: void SFlash_Chip_Erase()
void SFlash_Chip_Erase()
{
	(*(<anonymous> **) 0x210109A0)();
}

// 4200C72C: void SFlash_Sector_Erase()
void SFlash_Sector_Erase()
{
	(*(<anonymous> **) 0x210109A4)();
}

// 4200C736: void SFlash_Blk32_Erase()
void SFlash_Blk32_Erase()
{
	(*(<anonymous> **) 553716136)();
}

// 4200C740: void SFlash_Blk64_Erase()
void SFlash_Blk64_Erase()
{
	(*(<anonymous> **) 0x210109AC)();
}

// 4200C74A: void SFlash_Erase()
void SFlash_Erase()
{
	(*(<anonymous> **) 0x210109B0)();
}

// 4200C754: void SFlash_Program()
void SFlash_Program()
{
	(*(<anonymous> **) 0x210109B4)();
}

// 4200C75E: void SFlash_GetUniqueId()
void SFlash_GetUniqueId()
{
	(*(<anonymous> **) 553716152)();
}

// 4200C768: void SFlash_GetJedecId()
void SFlash_GetJedecId()
{
	(*(<anonymous> **) 553716156)();
}

// 4200C772: void SFlash_GetDeviceId()
void SFlash_GetDeviceId()
{
	(*(<anonymous> **) 0x210109C0)();
}

// 4200C77C: void SFlash_Powerdown()
void SFlash_Powerdown()
{
	(*(<anonymous> **) 0x210109C4)();
}

// 4200C786: void SFlash_Releae_Powerdown()
void SFlash_Releae_Powerdown()
{
	(*(<anonymous> **) 0x210109C8)();
}

// 4200C790: void SFlash_SetBurstWrap()
void SFlash_SetBurstWrap()
{
	(*(<anonymous> **) 0x210109CC)();
}

// 4200C79A: void SFlash_DisableBurstWrap()
void SFlash_DisableBurstWrap()
{
	(*(<anonymous> **) 0x210109D0)();
}

// 4200C7A4: void SFlash_Software_Reset()
void SFlash_Software_Reset()
{
	(*(<anonymous> **) 0x210109D4)();
}

// 4200C7AE: void SFlash_Reset_Continue_Read()
void SFlash_Reset_Continue_Read()
{
	(*(<anonymous> **) 0x210109D8)();
}

// 4200C7B8: void SFlash_Set_IDbus_Cfg()
void SFlash_Set_IDbus_Cfg()
{
	(*(<anonymous> **) 0x210109DC)();
}

// 4200C7C2: void SFlash_IDbus_Read_Enable()
void SFlash_IDbus_Read_Enable()
{
	(*(<anonymous> **) 0x210109E0)();
}

// 4200C7CC: void SFlash_Cache_Enable_Set()
void SFlash_Cache_Enable_Set()
{
	(*(<anonymous> **) 0x210109E4)();
}

// 4200C7D6: void SFlash_Cache_Flush()
void SFlash_Cache_Flush()
{
	(*(<anonymous> **) 0x210109E8)();
}

// 4200C7E0: void SFlash_Cache_Read_Enable()
void SFlash_Cache_Read_Enable()
{
	(*(<anonymous> **) 0x210109EC)();
}

// 4200C7EA: void SFlash_Cache_Hit_Count_Get()
void SFlash_Cache_Hit_Count_Get()
{
	(*(<anonymous> **) 0x210109F0)();
}

// 4200C7F4: void SFlash_Cache_Miss_Count_Get()
void SFlash_Cache_Miss_Count_Get()
{
	(*(<anonymous> **) 0x210109F4)();
}

// 4200C7FE: void SFlash_Cache_Read_Disable()
void SFlash_Cache_Read_Disable()
{
	(*(<anonymous> **) 0x210109F8)();
}

// 4200C808: void SFlash_Read()
void SFlash_Read()
{
	(*(<anonymous> **) 0x210109FC)();
}

// 4200C812: void SFlash_Read_Reg_With_Cmd()
void SFlash_Read_Reg_With_Cmd()
{
	(*(<anonymous> **) 0x21010A00)();
}

// 4200C81C: void SFlash_Write_Reg_With_Cmd()
void SFlash_Write_Reg_With_Cmd()
{
	(*(<anonymous> **) 0x21010A04)();
}

// 4200C826: void SF_Cfg_Init_Ext_Flash_Gpio()
void SF_Cfg_Init_Ext_Flash_Gpio()
{
	(*(<anonymous> **) 0x21010A0C)();
}

// 4200C830: void SF_Cfg_Init_Internal_Flash_Gpio()
void SF_Cfg_Init_Internal_Flash_Gpio()
{
	(*(<anonymous> **) 0x21010A10)();
}

// 4200C83A: void SF_Cfg_Deinit_Ext_Flash_Gpio()
void SF_Cfg_Deinit_Ext_Flash_Gpio()
{
	(*(<anonymous> **) 0x21010A14)();
}

// 4200C844: void SF_Cfg_Restore_GPIO17_Fun()
void SF_Cfg_Restore_GPIO17_Fun()
{
	(*(<anonymous> **) 0x21010A18)();
}

// 4200C84E: void SF_Cfg_Get_Flash_Cfg_Need_Lock()
void SF_Cfg_Get_Flash_Cfg_Need_Lock()
{
	(*(<anonymous> **) 0x21010A1C)();
}

// 4200C858: void SF_Cfg_Init_Flash_Gpio()
void SF_Cfg_Init_Flash_Gpio()
{
	(*(<anonymous> **) 0x21010A20)();
}

// 4200C862: void SF_Cfg_Flash_Identify()
void SF_Cfg_Flash_Identify()
{
	(*(<anonymous> **) 0x21010A24)();
}

// 4200C86C: void SF_Ctrl_Enable()
void SF_Ctrl_Enable()
{
	(*(<anonymous> **) 0x21010A28)();
}

// 4200C876: void SF_Ctrl_Select_Pad()
void SF_Ctrl_Select_Pad()
{
	(*(<anonymous> **) 0x21010A2C)();
}

// 4200C880: void SF_Ctrl_Set_Owner()
void SF_Ctrl_Set_Owner()
{
	(*(<anonymous> **) 0x21010A30)();
}

// 4200C88A: void SF_Ctrl_Disable()
void SF_Ctrl_Disable()
{
	(*(<anonymous> **) 0x21010A34)();
}

// 4200C894: void SF_Ctrl_AES_Enable_BE()
void SF_Ctrl_AES_Enable_BE()
{
	(*(<anonymous> **) 0x21010A38)();
}

// 4200C89E: void SF_Ctrl_AES_Enable_LE()
void SF_Ctrl_AES_Enable_LE()
{
	(*(<anonymous> **) 0x21010A3C)();
}

// 4200C8A8: void SF_Ctrl_AES_Set_Region()
void SF_Ctrl_AES_Set_Region()
{
	(*(<anonymous> **) 0x21010A40)();
}

// 4200C8B2: void SF_Ctrl_AES_Set_Key()
void SF_Ctrl_AES_Set_Key()
{
	(*(<anonymous> **) 0x21010A44)();
}

// 4200C8BC: void SF_Ctrl_AES_Set_Key_BE()
void SF_Ctrl_AES_Set_Key_BE()
{
	(*(<anonymous> **) 0x21010A48)();
}

