pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_data.c
// 4200C8C6: void SF_Ctrl_AES_Set_IV()
void SF_Ctrl_AES_Set_IV()
{
	(*(<anonymous> **) 0x21010A4C)();
}

// 4200C8D0: void SF_Ctrl_AES_Set_IV_BE()
void SF_Ctrl_AES_Set_IV_BE()
{
	(*(<anonymous> **) 0x21010A50)();
}

// 4200C8DA: void SF_Ctrl_AES_Enable()
void SF_Ctrl_AES_Enable()
{
	(*(<anonymous> **) 0x21010A54)();
}

// 4200C8E4: void SF_Ctrl_AES_Disable()
void SF_Ctrl_AES_Disable()
{
	(*(<anonymous> **) 0x21010A58)();
}

// 4200C8EE: void SF_Ctrl_Set_Flash_Image_Offset()
void SF_Ctrl_Set_Flash_Image_Offset()
{
	(*(<anonymous> **) 553716316)();
}

// 4200C8F8: void SF_Ctrl_Get_Flash_Image_Offset()
void SF_Ctrl_Get_Flash_Image_Offset()
{
	(*(<anonymous> **) 0x21010A60)();
}

// 4200C902: void SF_Ctrl_Select_Clock()
void SF_Ctrl_Select_Clock()
{
	(*(<anonymous> **) 0x21010A64)();
}

// 4200C90C: void SF_Ctrl_SendCmd()
void SF_Ctrl_SendCmd()
{
	(*(<anonymous> **) 0x21010A68)();
}

// 4200C916: void SF_Ctrl_Icache_Set()
void SF_Ctrl_Icache_Set()
{
	(*(<anonymous> **) 553716332)();
}

// 4200C920: void SF_Ctrl_Icache2_Set()
void SF_Ctrl_Icache2_Set()
{
	(*(<anonymous> **) 0x21010A70)();
}

// 4200C92A: void SF_Ctrl_GetBusyState()
void SF_Ctrl_GetBusyState()
{
	(*(<anonymous> **) 0x21010A74)();
}

// 4200C934: void SF_Ctrl_Is_AES_Enable()
void SF_Ctrl_Is_AES_Enable()
{
	(*(<anonymous> **) 0x21010A78)();
}

// 4200C93E: void SF_Ctrl_Get_Clock_Delay()
void SF_Ctrl_Get_Clock_Delay()
{
	(*(<anonymous> **) 0x21010A7C)();
}

// 4200C948: void SF_Ctrl_Set_Clock_Delay()
void SF_Ctrl_Set_Clock_Delay()
{
	(*(<anonymous> **) 0x21010A80)();
}

// 4200C952: void XIP_SFlash_State_Save()
void XIP_SFlash_State_Save()
{
	(*(<anonymous> **) 553716356)();
}

// 4200C95C: void XIP_SFlash_State_Restore()
void XIP_SFlash_State_Restore()
{
	(*(<anonymous> **) 0x21010A88)();
}

// 4200C966: void XIP_SFlash_Erase_Need_Lock()
void XIP_SFlash_Erase_Need_Lock()
{
	(*(<anonymous> **) 0x21010A8C)();
}

// 4200C970: void XIP_SFlash_Write_Need_Lock()
void XIP_SFlash_Write_Need_Lock()
{
	(*(<anonymous> **) 0x21010A90)();
}

// 4200C97A: void XIP_SFlash_Read_Need_Lock()
void XIP_SFlash_Read_Need_Lock()
{
	(*(<anonymous> **) 0x21010A94)();
}

// 4200C984: void XIP_SFlash_GetJedecId_Need_Lock()
void XIP_SFlash_GetJedecId_Need_Lock()
{
	(*(<anonymous> **) 553716376)();
}

// 4200C98E: void XIP_SFlash_GetDeviceId_Need_Lock()
void XIP_SFlash_GetDeviceId_Need_Lock()
{
	(*(<anonymous> **) 0x21010A9C)();
}

// 4200C998: void XIP_SFlash_GetUniqueId_Need_Lock()
void XIP_SFlash_GetUniqueId_Need_Lock()
{
	(*(<anonymous> **) 0x21010AA0)();
}

// 4200C9A2: void XIP_SFlash_Read_Via_Cache_Need_Lock()
void XIP_SFlash_Read_Via_Cache_Need_Lock()
{
	(*(<anonymous> **) 0x21010AA4)();
}

// 4200C9AC: void XIP_SFlash_Read_With_Lock()
void XIP_SFlash_Read_With_Lock()
{
	(*(<anonymous> **) 0x21010AA8)();
}

// 4200C9B6: void XIP_SFlash_Write_With_Lock()
void XIP_SFlash_Write_With_Lock()
{
	(*(<anonymous> **) 0x21010AAC)();
}

// 4200C9C0: void XIP_SFlash_Erase_With_Lock()
void XIP_SFlash_Erase_With_Lock()
{
	(*(<anonymous> **) 0x21010AB0)();
}

// 4200C9CA: void XIP_SFlash_Opt_Enter()
void XIP_SFlash_Opt_Enter()
{
	(*(<anonymous> **) 0x21010AB4)();
}

// 4200C9D4: void XIP_SFlash_Opt_Exit()
void XIP_SFlash_Opt_Exit()
{
	(*(<anonymous> **) 0x21010AB8)();
}

// 4200C9DE: void BFLB_Soft_CRC32()
void BFLB_Soft_CRC32()
{
	(*(<anonymous> **) 0x21010ABC)();
}

// 4200C9E8: void ADC_Trim_TSEN(Register (ptr32 word16) a0, Register ui32 a4, Register word32 s4, Register word32 s5, Stack word32 dwArg04, Stack word32 dwArgA4)
void ADC_Trim_TSEN(word16 * a0, ui32 a4, word32 s4, word32 s5, word32 dwArg04, word32 dwArgA4)
{
	word16 * s2_106 = a0;
	uint32 a0_24 = EF_Ctrl_Read_TSEN_Trim(a4);
	if (a0_24 << 0x12 >= 0x00)
		return;
	uint32 a0_39 = (a0_24 & 0x00FFFFFF) << 16;
	uint32 a0_107 = a0_39 >> 16;
	ui32 a5_43 = EF_Ctrl_Get_Trim_Parity();
	if ((a0_24 >> 0x0C & 0x01) != a0_39 >> 16)
		return;
	*a0 = (word16) (a5_43 & 0x00FFFFFF);
	ui32 s1_108 = a5_43 & 0x04000000;
	word32 s0_50 = 0x00;
	if ((a5_43 & 0x04000000) == 0x00)
	{
		*(ui32 *) 0x4001090C = *(int32 *) 0x4000F90C & ~0x00080000;
		word32 a4_54 = ~0x00080000;
		int32 s3_109 = 50;
		do
		{
			word32 s0_73;
			ui32 s3_75;
			word32 fs1_87;
			word32 fs0_88;
			word32 fa0_89;
			g_t23052E86();
			s3_109 = s3_75 & 0x00FF;
			s0_50 = s0_73 + a0_107;
		} while ((s3_75 & 0x00FF) != 0x00);
		*(ui32 *) 0x4001090C = *(int32 *) 0x4000F90C | 0x00080000;
		word32 a4_112 = 0x40010000;
		int32 s0_102 = 50;
		do
		{
			ui32 s0_118;
			word32 s1_119;
			word32 fs1_132;
			word32 fs0_133;
			word32 fa0_134;
			g_t23052E86();
			s0_102 = s0_118 & 0x00FF;
			s1_108 = s1_119 + a0_107;
		} while ((s0_118 & 0x00FF) != 0x00);
		word32 s2_146;
		word32 a0_147;
		word32 s0_149;
		word32 s1_150;
		word32 s3_151;
		word32 a1_160;
		word32 a4_162;
		word32 fs1_163;
		g_t23070708();
		word32 s2_172;
		word32 a0_173;
		word32 s0_175;
		word32 s1_176;
		word32 s3_177;
		word32 s4_178;
		word32 s5_179;
		word32 a4_188;
		g_t23070708();
		word32 s2_198;
		word32 a0_199;
		word32 s0_201;
		word32 s1_202;
		word32 s3_203;
		word32 s4_204;
		word32 s5_205;
		word32 a1_212;
		word32 a4_214;
		g_t2306F140();
		word32 s2_225;
		word32 a0_226;
		word32 s0_228;
		word32 s1_229;
		word32 s3_230;
		word32 a1_239;
		word32 a4_241;
		word32 fs0_243;
		g_t2306F8DC();
		word32 s2_251;
		word32 a0_252;
		word32 s0_254;
		word32 s1_255;
		word32 s3_256;
		word32 s4_257;
		word32 s5_258;
		word32 a4_267;
		g_t23070708();
		word32 s2_277;
		word32 a0_278;
		word32 s0_280;
		word32 s1_281;
		word32 s3_282;
		word32 s4_283;
		word32 s5_284;
		word32 a1_291;
		word32 a4_293;
		g_t2306F140();
		word32 s2_304;
		word32 a0_305;
		word32 s0_307;
		word32 s1_308;
		word32 s3_309;
		word32 s4_310;
		word32 s5_311;
		word32 a4_320;
		g_t2306DAA4();
		word32 s2_330;
		word32 a0_331;
		word32 s0_333;
		word32 s1_334;
		word32 s3_335;
		word32 s4_336;
		word32 s5_337;
		word32 a4_346;
		g_t2306DAA4();
		word16 * s2_353;
		word32 fs1_370;
		real32 fs0_371;
		real32 fa0_372;
		g_t23070818();
		real32 fa0_374 = fa0_372 + fs0_371;
		*s2_353 = (word16) (uint32) fa0_374;
	}
}

// 4200CB5C: void ADC_Gain_Trim(Register (ptr32 Eq_362695) a4, Stack word32 dwArg14, Stack word32 dwArgB4, Stack word32 dwArg0128)
void ADC_Gain_Trim(struct Eq_362695 * a4, word32 dwArg14, word32 dwArgB4, word32 dwArg0128)
{
	word32 a4_21;
	uint32 a0_18 = EF_Ctrl_Read_ADC_Gain_Trim(a4, out a4_21);
	if (a0_18 << 0x12 < 0x00)
	{
		EF_Ctrl_Get_Trim_Parity();
		if ((a0_18 >> 0x0C & 0x01) == (word32) ((word16) (a0_18 & 0x00FFFFFF)))
		{
			word32 a4_112;
			word32 s4_103;
			word32 s3_102;
			word32 s2_101;
			word32 s1_100;
			word32 s0_163;
			g_b4200D96C = 0x01;
			g_w4200D96E = 0x01;
			if (false)
			{
				word32 s0_121;
				word32 s1_122;
				word32 s2_123;
				word32 s3_124;
				word32 s4_125;
				word32 a4_134;
				g_t23070708();
				word32 s0_142;
				word32 s1_143;
				word32 s2_144;
				word32 s3_145;
				word32 s4_146;
				word32 a4_155;
				g_t2306F140();
				word32 a1_173;
				word32 fa0_174;
				g_t2306DAA4();
			}
			else
			{
				word32 s0_55;
				word32 s1_56;
				word32 s2_57;
				word32 s3_58;
				word32 s4_59;
				word32 a4_68;
				g_t23070708();
				word32 a0_74;
				word32 s0_76;
				word32 s1_77;
				word32 s2_78;
				word32 s3_79;
				word32 s4_80;
				word32 a1_86;
				word32 a4_89;
				g_t2306F140();
				word32 a1_109;
				word32 fa0_110;
				g_t2306F8DC();
			}
			struct Eq_362772 * a0_187;
			real32 s0_189;
			word32 a1_199;
			word32 fa0_200;
			g_t23070818();
			a0_187->r0004 = s0_189;
l4200CB7A:
			0x00 = dwArg0128;
			return;
		}
	}
	goto l4200CB7A;
}

