pine64/bl602-re/blobs/bl602_demo_wifi.reko/bl602_demo_wifi_data.c
// 4200CCE4: Register word32 EF_Ctrl_Read_TSEN_Trim(Register ui32 a4)
// Called from:
//      ADC_Trim_TSEN
word32 EF_Ctrl_Read_TSEN_Trim(ui32 a4)
{
	EF_Ctrl_Sw_AHB_Clk_0();
	EF_Ctrl_Load_Efuse_R0();
	word32 a0_18 = *(a4 & 0x01);
	word32 * a4_22 = a4 & 0x01 & ~0x02000000 | (a4 & 0x01) << 0x0D;
	*a4_22 = a0_18;
	word32 * a5_33 = (a4_22 & 0xFF000000 | 0x0FFF) & ~0x01000000 | 0x01000000;
	*a5_33 = a0_18;
	*(a5_33 & ~0x04000000) = a0_18;
	return a0_18;
}

// 4200CD40: Register word32 EF_Ctrl_Read_ADC_Gain_Trim(Register (ptr32 Eq_362695) a4, Register out Eq_362704 a4Out)
// Called from:
//      ADC_Gain_Trim
word32 EF_Ctrl_Read_ADC_Gain_Trim(struct Eq_362695 * a4, union Eq_362704 & a4Out)
{
	EF_Ctrl_Sw_AHB_Clk_0();
	EF_Ctrl_Load_Efuse_R0();
	word32 * a5_14 = a4->ptr0078;
	ui32 a4_29 = a4 >> 0x0E & 0x01;
	word32 a0_15 = *a5_14;
	*(((a5_14 & 0xFF000000 | (a4 << 0x13) >> 20) & ~0x01000000 | (a4 >> 0x0D & 0x01) << 0x0C) & ~0x02000000 | a4_29 << 0x0D) = a0_15;
	a4Out = a4_29 << 0x0D;
	return a0_15;
}

// 4200CD86: void AON_Power_On_MBG()
void AON_Power_On_MBG()
{
	(*(<anonymous> **) 0x21010810)();
}

// 4200CD90: void AON_Power_Off_MBG()
void AON_Power_Off_MBG()
{
	(*(<anonymous> **) 0x21010814)();
}

// 4200CD9A: void AON_Power_On_XTAL()
void AON_Power_On_XTAL()
{
	(*(<anonymous> **) 0x21010818)();
}

// 4200CDA4: void AON_Set_Xtal_CapCode()
void AON_Set_Xtal_CapCode()
{
	(*(<anonymous> **) 0x2101081C)();
}

// 4200CDAE: void AON_Get_Xtal_CapCode()
void AON_Get_Xtal_CapCode()
{
	(*(<anonymous> **) 0x21010820)();
}

// 4200CDB8: void AON_Power_Off_XTAL()
void AON_Power_Off_XTAL()
{
	(*(<anonymous> **) 0x21010824)();
}

// 4200CDC2: Register word32 EF_Ctrl_Get_Trim_Parity()
// Called from:
//      ADC_Trim_TSEN
//      ADC_Gain_Trim
word32 EF_Ctrl_Get_Trim_Parity()
{
	word32 a5_7;
	(*(<anonymous> **) 0x21010888)();
	return a5_7;
}

// 4200CDCC: void EF_Ctrl_Read_RC32M_Trim()
void EF_Ctrl_Read_RC32M_Trim()
{
	(*(<anonymous> **) 0x2101088C)();
}

// 4200CDD6: void EF_Ctrl_Read_RC32K_Trim()
void EF_Ctrl_Read_RC32K_Trim()
{
	(*(<anonymous> **) 0x21010890)();
}

// 4200CDE0: void GLB_Get_Root_CLK_Sel()
void GLB_Get_Root_CLK_Sel()
{
	(*(<anonymous> **) 0x21010898)();
}

// 4200CDEA: void GLB_Set_System_CLK_Div()
void GLB_Set_System_CLK_Div()
{
	(*(<anonymous> **) 553715868)();
}

// 4200CDF4: void GLB_Get_BCLK_Div()
void GLB_Get_BCLK_Div()
{
	(*(<anonymous> **) 0x210108A0)();
}

// 4200CDFE: void GLB_Get_HCLK_Div()
void GLB_Get_HCLK_Div()
{
	(*(<anonymous> **) 553715876)();
}

// 4200CE08: void Update_SystemCoreClockWith_XTAL()
void Update_SystemCoreClockWith_XTAL()
{
	(*(<anonymous> **) 0x210108A8)();
}

// 4200CE12: void GLB_Set_System_CLK()
void GLB_Set_System_CLK()
{
	(*(<anonymous> **) 553715884)();
}

// 4200CE1C: void System_Core_Clock_Update_From_RC32M()
void System_Core_Clock_Update_From_RC32M()
{
	(*(<anonymous> **) 0x210108B0)();
}

// 4200CE26: void GLB_Set_SF_CLK()
void GLB_Set_SF_CLK()
{
	(*(<anonymous> **) 0x210108B4)();
}

// 4200CE30: void GLB_Set_PKA_CLK_Sel()
void GLB_Set_PKA_CLK_Sel()
{
	(*(<anonymous> **) 0x210108B8)();
}

// 4200CE3A: void HBN_32K_Sel()
void HBN_32K_Sel()
{
	(*(<anonymous> **) 0x21010908)();
}

// 4200CE44: void HBN_Set_ROOT_CLK_Sel()
void HBN_Set_ROOT_CLK_Sel()
{
	(*(<anonymous> **) 0x2101090C)();
}

// 4200CE4E: void HBN_Power_On_Xtal_32K()
void HBN_Power_On_Xtal_32K()
{
	(*(<anonymous> **) 0x21010910)();
}

// 4200CE58: void HBN_Power_Off_Xtal_32K()
void HBN_Power_Off_Xtal_32K()
{
	(*(<anonymous> **) 0x21010914)();
}

// 4200CE62: void HBN_Power_On_RC32K()
void HBN_Power_On_RC32K()
{
	(*(<anonymous> **) 0x21010918)();
}

// 4200CE6C: void HBN_Power_Off_RC32K()
void HBN_Power_Off_RC32K()
{
	(*(<anonymous> **) 0x2101091C)();
}

// 4200CE76: void HBN_Trim_RC32K()
void HBN_Trim_RC32K()
{
	(*(<anonymous> **) 0x21010920)();
}

// 4200CE80: void PDS_Trim_RC32M()
void PDS_Trim_RC32M()
{
	(*(<anonymous> **) 0x21010954)();
}

// 4200CE8A: void PDS_Select_RC32M_As_PLL_Ref()
void PDS_Select_RC32M_As_PLL_Ref()
{
	(*(<anonymous> **) 553716056)();
}

// 4200CE94: void PDS_Select_XTAL_As_PLL_Ref()
void PDS_Select_XTAL_As_PLL_Ref()
{
	(*(<anonymous> **) 0x2101095C)();
}

// 4200CE9E: void PDS_Power_On_PLL()
void PDS_Power_On_PLL()
{
	(*(<anonymous> **) 0x21010960)();
}

// 4200CEA8: void PDS_Enable_PLL_All_Clks()
void PDS_Enable_PLL_All_Clks()
{
	(*(<anonymous> **) 0x21010964)();
}

// 4200CEB2: void PDS_Disable_PLL_All_Clks()
void PDS_Disable_PLL_All_Clks()
{
	(*(<anonymous> **) 0x21010968)();
}

// 4200CEBC: void PDS_Enable_PLL_Clk()
void PDS_Enable_PLL_Clk()
{
	(*(<anonymous> **) 0x2101096C)();
}

// 4200CEC6: void PDS_Disable_PLL_Clk()
void PDS_Disable_PLL_Clk()
{
	(*(<anonymous> **) 0x21010970)();
}

// 4200CED0: void PDS_Power_Off_PLL()
void PDS_Power_Off_PLL()
{
	(*(<anonymous> **) 0x21010974)();
}

Eq_5041 g_t4200CEDC = 
	{
		0x42020D66,
		0x00020A9A,
	};
byte g_a4200CEFC[5] = 
	{
		0x12,
		0x12,
		0x12,
		0x12,
		0x12,
	};
byte g_a4200CF04[] = 
	{
	};
byte g_a4200CF0C[] = 
	{
	};
uint16 g_a4200CF14[22] = 
	{
		~0x5914,
		42802,
		~0x5886,
		42944,
		0xA808,
		0xA84F,
		0xA896,
		~0x5722,
		43300,
		43371,
		43442,
		~0x5606,
		0xAA40,
		0xAA87,
		~0x5530,
		0xAB16,
		~0x54A2,
		0xABA4,
		44011,
		44082,
		44153,
		0x00,
	};
word16 g_w4200CF3C = 44153;
int32 g_dw4200CF40 = 0x14088889;
int32 g_dw4200CF64 = 0x14555555;
word32 g_dw4200CF94 = 0x00;
word32 g_dw4200CF98 = 0x00;
word32 g_dw4200CF9C = 0x00;
word32 g_dw4200CFA0 = 0x00;
word32 g_dw4200CFA4 = 0x00;
word32 g_dw4200CFA8 = 0x00;
word32 g_dw4200CFAC = 0x00;
word32 g_dw4200CFB0 = 0x00;
word32 g_dw4200CFB4 = 0x01;
word32 g_dw4200CFB8 = 8000000;
word32 g_dw4200CFBC = 0x01;
word32 g_dw4200CFC0 = 3000000;
word32 g_dw4200CFC4 = 0x01;
word32 g_dw4200CFC8 = 4292967296;
word32 g_dw4200CFCC = 0x01;
word32 g_dw4200CFD0 = 0xFF953040;
word32 g_dw4200CFD4 = 0x00;
word32 g_dw4200CFD8 = 0x00;
word32 g_dw4200CFDC = 0x00;
word32 g_dw4200CFE0 = 0x00;
word32 g_dw4200CFE4 = 0x00;
word32 g_dw4200CFE8 = 0x00;
word32 g_dw4200CFEC = 0x00;
word32 g_dw4200CFF0 = 0x00;
word32 g_dw4200CFF4 = 0x01;
word32 g_dw4200CFF8 = 8000000;
word32 g_dw4200CFFC = 0x01;
word32 g_dw4200D000 = ~0x003D08FF;
Eq_69636 g_t4200D004 = 
	{
		~0x04,
		0x0F,
	};
word32 g_dw4200D014 = 0x0F;
int32 g_dw4200D018 = 0x0033;
byte g_a4200D038[17] = 
	{
		252,
		~0x07,
		252,
		~0x07,
		252,
		~0x07,
		252,
		~0x07,
		252,
		~0x07,
		~0x04,
		~0x08,
		252,
		~0x07,
		~0x04,
		~0x08,
		0x01,
	};
Eq_2 g_t4200D08C = 
	{
		0x01
	};
Eq_111565 g_t4200D438 = 
	{
		0x00,
		0x00,
		
		{
			0x00
		},
		0x00,
	};
byte g_b4200D47A = 0x00;
byte g_b4200D47B = 0x00;
Eq_2 g_t4200D4A8 = 
	{
		0xC02B
	};
Eq_2 g_t4200D4AC = 
	{
		0xC02C
	};
Eq_2 g_t4200D4B0 = 
	{
		0x00
	};
Eq_2 g_t4200D4B4 = 
	{
		0x06
	};
Eq_2 g_t4200D4C0 = 
	{
		0x00
	};
word32 g_dw4200D4F0 = 0x00;
Eq_2 g_t4200D50C = 
	{
		0x00
	};
int32 g_dw4200D8F0 = 31;
byte g_b4200D8F4 = ~0x00;
Eq_2 g_t4200D904 = 
	{
		~0x00
	};
int32 g_dw4200D908 = 0x02CC;
int8 g_b4200D90C = -0x0080;
uint16 g_w4200D918 = 0xA6A0;
uint16 g_w4200D91A = 0xA6E0;
uint16 g_w4200D91C = 0xACE0;
uint16 g_w4200D91E = 0x0855;
uint16 g_w4200D924 = 0x05;
uint16 g_w4200D926 = 0x05;
uint16 g_w4200D928 = 0x05;
struct Eq_68109 * g_ptr4200D92C = &g_t42011F74;
Eq_2 g_t4200D934 = 
	{
		54700
	};
int32 g_dw4200D938 = 92;
int8 g_b4200D93C = -1;
int8 g_b4200D93D = -1;
uint16 g_w4200D948 = ~0x00;
byte g_b4200D94A = 0x01;
uint16 g_w4200D950 = 0xC000;
uint16 g_w4200D952 = 0xC000;
Eq_256667 g_t4200D954 = 
	{
		<code>,
		&g_t4200D954,
		0x01,
	};
Eq_2 g_t4200D960 = 
	{
		~0x00
	};
byte g_b4200D964 = 0x01;
Eq_2 g_t4200D968 = 
	{
		0x2800
	};
byte g_b4200D96C = 0x00;
word16 g_w4200D96E = 0x00;
byte g_b4200D974 = 0x03;
Eq_2 g_t4200D97C = 
	{
		0x08
	};
union Eq_2 * g_ptr4200D994 = &g_t4200D4C0;
Eq_2 g_t4200D9B8 = 
	{
		0x00
	};
Eq_2 g_t4200D9BC = 
	{
		0x00
	};
